In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame({'nome':['Rafael','Maria','João'],
                  'idade':[10,30,20]})

df

     nome  idade
0  Rafael     10
1   Maria     30
2    João     20

In [7]:
df.loc[0, 'nome'] = 'Rafael2'
df

      nome  idade
0  Rafael2     10
1    Maria     30
2     João     20

In [9]:
df['sexo'] = ['M','F','M']
df

      nome  idade sexo
0  Rafael2     10    M
1    Maria     30    F
2     João     20    M

In [10]:
df = df.append({'nome':'Ana', 'idade':15, 'sexo':'F'}, ignore_index=True)
df

      nome  idade sexo
0  Rafael2     10    M
1    Maria     30    F
2     João     20    M
3      Ana     15    F